Revit 2024 API
ParameterTypeId.BoundaryAreaRestraintX Property
 "X Spring Modulus"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId BoundaryAreaRestraintX { get; }
Visual Basic
Public Shared ReadOnly Property BoundaryAreaRestraintX As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ BoundaryAreaRestraintX {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace